snlkuharlocal/src/Documents/ЗаданиеНаСборкуКомплектовЧЗ/ЗаданиеНаСборкуКомплектовЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаСборкуКомплектовЧЗ</name>
  <comment>Задание на сборку комплектов ЗЧ</comment>
  <basedOn>Document.ЗаданиеНабора</basedOn>
  <basedOn>Document.Комплектация</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.РезервыКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <registerRecords>InformationRegister.ОшибкиПолученияКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СформированыАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНабора</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработкиЧЗ</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМаркированыеКомплектующие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛистСборки</name>
      <type>
        <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Распечатан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Нанесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированПодСборку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиФакт/СтатусыКодовМаркировкиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиФакт</name>
  <enumValues>
    <name>Эмитирован</name>
  </enumValues>
  <enumValues>
    <name>ПереданПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПечати</name>
  </enumValues>
  <enumValues>
    <name>Распечатан</name>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
  </enumValues>
  <enumValues>
    <name>НанесенВиртуально</name>
  </enumValues>
  <enumValues>
    <name>Вложен</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ЗакупленВРФ</name>
  </enumValues>
  <enumValues>
    <name>Выбыл</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяАгрегация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаданиеНаСборкуКомплектовЧЗ/ObjectModule.bsl
#Область СобытияОбъекта


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) экспорт
	ЗаполнитьШапкуДокумента(ЭтотОбъект, ПараметрыСеанса.Пользователь);
	
	ДокОснование	= ДанныеЗаполнения;
	Если НЕ ЗначениеЗаполнено(ДокОснование) Тогда Возврат КонецЕсли;
	
	Дата = ТекущаяДата();
	
	ТипОснования = ТипЗнч(ДокОснование);
	
	рШапки 			= ПолучитьРеквизитыШапки(ДокОснование, "Организация"); 
	Организация		= рШапки.Организация;
	Подразделение	= ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();
	
	Если ТипОснования= Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		ИспользоватьМаркированыеКомплектующие = ПолучитьРеквизитШапки(ДокОснование, "Склад.ЭтоСкладМаркированногоТовара");		
		ЗаполнитьТЧПоОснованию();			
	ИначеЕсли ТипОснования= Тип("ДокументСсылка.Комплектация") Тогда
		ЗаполнитьТЧПоОснованию();			
	КонецЕсли;   
	//Валетов + 13,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8380 Если организация НЕ ЕЕЭ, меняем на неё
	Если НЕ СокрЛП(Организация.Код) = "SS-001" Тогда
		Организация = Справочники.Организации.НайтиПоКоду("SS-001");
	КонецЕсли;
	//Валетов -	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	СтатусКМ_Факт		= Перечисления.СтатусыКодовМаркировкиФакт.Распечатан;
			
	Для Каждого СтрокаТЧ из ШтрихкодыУпаковок Цикл		
		Движение = Движения.СтатусыКМ_Факт.Добавить();		
		
		Движение.Период				= Дата;
		Движение.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодУпаковки;		
		Движение.Местонахождение	= Подразделение;
		
		Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.Распечатан;			
		
		Если Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение И СтрокаТЧ.Нанесен Тогда			
			Движение.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.Нанесен;
		КонецЕсли;
		
		
		// Кухарь А.Ю.  19.01.2025 начало
		// У забронированных под сборку своя логика статусов будет. Пока не знаю какая)
		Если СтрокаТЧ.ЗабронированПодСборку Тогда			
			если не СтрокаТЧ.Распечатан тогда
				Движение.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован;	 
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	КодыКоробок = ШтрихкодыУпаковок.Выгрузить(,"ШтрихКодКоробки");
	КодыКоробок.Свернуть("ШтрихКодКоробки");
	
	Для Каждого СтрТЧ из КодыКоробок Цикл		
		Если НЕ ЗначениеЗаполнено(СтрТЧ.ШтрихКодКоробки) Тогда Продолжить КонецЕсли;
		
		Движение = Движения.СтатусыКМ_Факт.Добавить();		
		Движение.Период				= Дата;
		Движение.ШтрихКодУпаковки	= СтрТЧ.ШтрихКодКоробки;		
		Движение.Местонахождение	= Подразделение;
		Движение.Статус				= СтатусКМ_Факт;
	КонецЦикла;
	
	ЗаписатьВЛог("Отладка", "Штатная.ОбработкаПроведения", "");
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		Префикс = СокрЛП(Организация.Префикс);	
	КонецЕсли; 
	Префикс = Префикс+Маркировка_ПИ.ЭтотУзел_Код("Основной")+"-";
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор 					= ПараметрыСеанса.Пользователь;
	Комментарий 			= "";
	СостояниеНакладной 		= Перечисления.СостоянияНакладной.ВРаботе;
	СформированыАгрегации   = Ложь;
	
	Товары.Очистить();
	ШтрихкодыУпаковок.Очистить();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	
	рПроверки = КонтрольДублейЗСБ();
	Если НЕ рПроверки.Успешно Тогда
		МаркировкаКС.ВывестиОшибки(рПроверки);
		Отказ = Истина;
		Возврат;	
	КонецЕсли; 
	
	Если Модифицированность() Тогда
		КоличествоДокумента 	= Товары.Итог("Количество");
		КоличествоКомплектующих = Комплектующие.Итог("Количество");
		ГруппыТоваров			= ГруппыТоваровДокумента(ЭтотОбъект);
		
		КоличествоШК 			= ШтрихкодыУпаковок.Количество();
	КонецЕсли;
	
	Если ЭтоНовый() Тогда          
		//Валетов + 13,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8380 Если организация НЕ ЕЕЭ, меняем на неё
		Если Организация <> Маркировка_ПИ.ОрганизацияЕЕЭ() Тогда
			Организация = Маркировка_ПИ.ОрганизацияЕЕЭ();			
		КонецЕсли;
		//Валетов -
		
		//+++Чирков 10.02.2026
		ДатаСоздания = ТекущаяДата();		
		//---Чирков 10.02.2026
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти 

Функция КонтрольДублейЗСБ()
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если ЗначениеЗаполнено(ДокОснование) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Ссылка 
		|ИЗ
		|	Документ.ЗаданиеНаСборкуКомплектовЧЗ
		|ГДЕ
		|	ДокОснование = &ДокОснование
		|	И Ссылка <> &Ссылка
		// Кельманов А.В. - MARK-2511 - 2025.07.01 {
		//// Кельманов А.В. - HELP-4816 - 2025.05.06 {
		//|	И Проведен
		//// Кельманов А.В. - HELP-4816 - 2025.05.06 }
		// Кельманов А.В. - MARK-2511 - 2025.07.01 }
		|";
		
		// Кельманов А.В. - MARK-2511 - 2025.07.01 {
		Если ДокОснование.Дата < '20250702' Тогда
			
			Запрос.Текст = Запрос.Текст + "
			|	И Проведен";
			
		КонецЕсли;
		// Кельманов А.В. - MARK-2511 - 2025.07.01 }
		
		Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
		Запрос.УстановитьПараметр("ДокОснование", 	ДокОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Ошибки.Добавить(СтрШаблон("Уже существует ЗСБ %1 к документу: %2 !", Выборка.Ссылка, ДокОснование));		
		КонецЦикла; 
	КонецЕсли;	
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //КонтрольДублейЗСБ()

// Кельманов А.В. - для возможности заполнить ТЧ по нажатию кнопки - 2025.04.01 {
//Функция ЗаполнитьТЧПоОснованию()
Функция ЗаполнитьТЧПоОснованию() Экспорт
// Кельманов А.В. - для возможности заполнить ТЧ по нажатию кнопки - 2025.04.01 }
	Запрос 		 = Новый ("Запрос");
	Запрос.Текст = "
	|ВЫБРАТЬ	
	|	Номенклатура,
	|	Количество КАК Количество,	
	|	Единица, 
	//Валетов + 09,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8085
	//|	Коэффициент
	|	1 КАК Коэффициент
	//Валетов -
	|ИЗ
	|	" + ДокОснование.Метаданные().ПолноеИмя() + ".Товары
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	|	И ТребуетсяМаркировка
	|	И Количество > 0	
	|;
	|ВЫБРАТЬ
	|	Продукция,
	|	Номенклатура,
	|	Количество КАК Количество,
	|	Единица,
	//Валетов + 09,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8085
	//|	Коэффициент
	|	1 КАК Коэффициент
	//Валетов -
	|ИЗ
	|	" + ДокОснование.Метаданные().ПолноеИмя() + ".Комплектующие
	|ГДЕ
	|	Ссылка = &Ссылка	
	|	И Продукция.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	|	И ТребуетсяМаркировка
	|	И Количество > 0
	|";		
	
	Запрос.УстановитьПараметр("Ссылка", ДокОснование);
	
	// Кельманов А.В. - HELP-4849 - 2026.04.28 {
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.Комплектация") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТребуетсяМаркировка", "");
		
	КонецЕсли;
	// Кельманов А.В. - HELP-4849 - 2026.04.28 }
	
	рЗапроса = Запрос.ВыполнитьПакет();	
	
	Товары.Очистить();
	Комплектующие.Очистить();	
	
	Товары.Загрузить(рЗапроса[0].Выгрузить());
	Комплектующие.Загрузить(рЗапроса[1].Выгрузить());	
КонецФункции //ЗаполнитьТЧПоОснованию()

Процедура ОбработкаУдаленияПроведения(Отказ)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Если ШтрихкодыУпаковок.Количество() > 0 Тогда
		Сообщить("Запрещено распроводить документ c заполненной ТЧ 'ШтрихкодыУпаковок' !");
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры //ОбработкаУдаленияПроведения(Отказ)
